<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"2f707430c292ae15909cf69b2c12683545a216100c4224aefa0372d576fad209","plan_job_ref":"Job terraform plan #113 at https://github.com/suzutan/infra/actions/runs/15641424633","plan_out_hash":"fa6b23ffb7ecba122b747dafdeca39e798962eded25a7a8f3d5bceddefc69506","plan_hash":"78d0972ee0839ac531cd1ba2d48246014d7ce06550f4e697a9114fe37a79fb70","plan_text_format":"diff","version":"2.0.1"} -->
Terraform plan in __terraform/harvestasya.org__
<details>
<summary>Plan: 0 to add, 1 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # cloudflare_zero_trust_tunnel_cloudflared_config.k8s_ingress will be updated in-place
!~  resource "cloudflare_zero_trust_tunnel_cloudflared_config" "k8s_ingress" {
!~      config     = {
!~          ingress        = [
!~              {
!~                  origin_request = {
+                       access                 = (known after apply)
#                        (11 unchanged attributes hidden)
                    }
#                    (3 unchanged attributes hidden)
                },
!~              {
!~                  origin_request = {
+                       access                 = (known after apply)
#                        (11 unchanged attributes hidden)
                    }
#                    (3 unchanged attributes hidden)
                },
!~              {
!~                  origin_request = {
+                       access                 = (known after apply)
#                        (11 unchanged attributes hidden)
                    }
#                    (3 unchanged attributes hidden)
                },
!~              {
!~                  origin_request = {
+                       access                 = (known after apply)
#                        (11 unchanged attributes hidden)
                    }
#                    (3 unchanged attributes hidden)
                },
!~              {
!~                  origin_request = {
+                       access                 = (known after apply)
#                        (11 unchanged attributes hidden)
                    }
#                    (3 unchanged attributes hidden)
                },
!~              {
!~                  origin_request = {
+                       access                 = (known after apply)
#                        (11 unchanged attributes hidden)
                    }
#                    (3 unchanged attributes hidden)
                },
!~              {
!~                  origin_request = {
+                       access                 = (known after apply)
#                        (11 unchanged attributes hidden)
                    }
#                    (3 unchanged attributes hidden)
                },
!~              {
!~                  origin_request = {
+                       access                 = (known after apply)
#                        (11 unchanged attributes hidden)
                    }
#                    (3 unchanged attributes hidden)
                },
!~              {
!~                  origin_request = {
+                       access                 = (known after apply)
#                        (11 unchanged attributes hidden)
                    }
#                    (3 unchanged attributes hidden)
                },
!~              {
!~                  origin_request = {
+                       access                 = (known after apply)
#                        (11 unchanged attributes hidden)
                    }
#                    (3 unchanged attributes hidden)
                },
!~              {
+                   origin_request = (known after apply)
#                    (2 unchanged attributes hidden)
                },
            ]
+           origin_request = (known after apply)
!~          warp_routing   = {
!~              enabled = false -> (known after apply)
            } -> (known after apply)
        }
!~      created_at = "2025-06-01T08:40:16Z" -> (known after apply)
        id         = "36d574cb-f554-4320-a995-61af899df181"
!~      source     = "cloudflare" -> "local"
!~      version    = 3 -> (known after apply)
#        (2 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [terraform plan #113](https://github.com/suzutan/infra/actions/runs/15641424633)